In [1]:
import camelot as cm
import ghostscript

In [7]:
input_pdf = cm.read_pdf("india_factsheet_economic_n_hdi.pdf", flavor='lattice', pages='1, 2')

Overwriting cache for 0 71
Overwriting cache for 0 71
Overwriting cache for 0 71

In [8]:
input_pdf

In [9]:
for n in input_pdf:
  print(n)

<Table shape=(4, 3)>
<Table shape=(15, 3)>
<Table shape=(14, 4)>
<Table shape=(13, 3)>

In [11]:
# 2 because python is 0 index, asking for "n" above, number 3 as Dataframe  
input_pdf[2].df

,0,1,2,3
0,Human Development Indicators,,2000,2011
1,13,Human Development Index Value (HDI),0.461,0.547
2,14,HDI Rank (out of 187),,134
3,15,Inequality Adjusted Human Development Index Value,,0.392
4,16,Loss in HDI due to Inequalities (%),,28.7
5,,,2001,2011
6,17,Gender Inequality Index (GII),0.5531,0.617
7,18,GII Rank (out of 146),,129
8,,,1996,2006
9,19,Gender Empowerment Measure (GEM),0.416,0.497
10,,,2001,2011
11,20,Literacy Rate (%),64.8,74.04
12,21,Male Literacy Rate (%),75.3,82.14
13,22,Female Literacy Rate (%),53.7,65.46

In [14]:
# i want input_pdf of 2, from that, i want the df and in the df i want the location 11 to 14, give me three columns
df = input_pdf[2].df.loc[11:14,1:3]

In [15]:
df

                           1     2      3
11         Literacy Rate (%)  64.8  74.04
12    Male Literacy Rate (%)  75.3  82.14
13  Female Literacy Rate (%)  53.7  65.46

In [17]:
df = df.reset_index(drop = True)
df

                          1     2      3
0         Literacy Rate (%)  64.8  74.04
1    Male Literacy Rate (%)  75.3  82.14
2  Female Literacy Rate (%)  53.7  65.46

In [19]:
df.columns = ["KPI", "2001", "2011"]
df

                        KPI  2001   2011
0         Literacy Rate (%)  64.8  74.04
1    Male Literacy Rate (%)  75.3  82.14
2  Female Literacy Rate (%)  53.7  65.46

In [20]:
# df location, column names convert to float
df.loc[:, ["2001", "2011"]] = df.loc[:,["2001", "2011"]].astype(float)

In [24]:
# put df Dataframe into csv file
df.to_csv("packt_output.csv")

In [25]:
ls

 El volumen de la unidad C no tiene etiqueta.
 El n�mero de serie del volumen es: CC23-5896

 Directorio de c:\Users\Hp\OneDrive\Escritorio\Nara Python\newenv\virtual_environments

31/01/2023  10:15 p. m.    <DIR>          .
31/01/2023  10:15 p. m.    <DIR>          ..
30/01/2023  08:10 p. m.                10 .gitignore
31/01/2023  09:41 a. m.    <DIR>          .ipynb_checkpoints
31/01/2023  10:14 p. m.            14,765 good.ipynb
31/01/2023  09:40 p. m.           850,276 india_factsheet_economic_n_hdi.pdf
31/01/2023  10:15 p. m.               124 packt_output.csv
30/01/2023  06:33 p. m.                22 README.md
30/01/2023  08:12 p. m.             2,738 requirements.txt
31/01/2023  09:14 a. m.    <DIR>          tidy_venv
               6 archivos        867,935 bytes
               4 dirs  89,866,760,192 bytes libres

In [28]:
# put df Dataframe into excel file
df.to_excel("table_from_pdf.xlsx")

In [30]:
ls

 El volumen de la unidad C no tiene etiqueta.
 El n�mero de serie del volumen es: CC23-5896

 Directorio de c:\Users\Hp\OneDrive\Escritorio\Nara Python\newenv\virtual_environments

31/01/2023  10:20 p. m.    <DIR>          .
31/01/2023  10:20 p. m.    <DIR>          ..
30/01/2023  08:10 p. m.                10 .gitignore
31/01/2023  09:41 a. m.    <DIR>          .ipynb_checkpoints
31/01/2023  10:21 p. m.            17,182 good.ipynb
31/01/2023  09:40 p. m.           850,276 india_factsheet_economic_n_hdi.pdf
31/01/2023  10:15 p. m.               124 packt_output.csv
30/01/2023  06:33 p. m.                22 README.md
30/01/2023  08:12 p. m.             2,738 requirements.txt
31/01/2023  10:21 p. m.             5,045 table_from_pdf.xlsx
31/01/2023  09:14 a. m.    <DIR>          tidy_venv
               7 archivos        875,397 bytes
               4 dirs  89,864,331,264 bytes libres

In [31]:
import pandas as pd

In [34]:
df2 = pd.read_csv("packt_output.csv")
df2

   Unnamed: 0                       KPI  2001   2011
0           0         Literacy Rate (%)  64.8  74.04
1           1    Male Literacy Rate (%)  75.3  82.14
2           2  Female Literacy Rate (%)  53.7  65.46

In [35]:
import seaborn as sns

In [37]:
# wide to long format
df_melted = df.melt('KPI', var_name = 'year', value_name = 'percentage')

In [38]:
df_melted

                        KPI  year percentage
0         Literacy Rate (%)  2001       64.8
1    Male Literacy Rate (%)  2001       75.3
2  Female Literacy Rate (%)  2001       53.7
3         Literacy Rate (%)  2011      74.04
4    Male Literacy Rate (%)  2011      82.14
5  Female Literacy Rate (%)  2011      65.46